; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_3)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 - link
    angle0 angle60 angle120 angle180 angle240 angle300 - angle)
(:init
    (AngleOrd angle0 angle60)
    (AngleOrd angle60 angle120)
    (AngleOrd angle120 angle180)
    (AngleOrd angle180 angle240)
    (AngleOrd angle240 angle300)
    (AngleOrd angle300 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)

    (HasAngle angle300 link1)
    (HasAngle angle300 link2)
    (HasAngle angle120 link3)
    (HasAngle angle0 link4)
)
(:goal
(and
    (HasAngle angle240 link1)
    (HasAngle angle120 link2)
    (HasAngle angle60 link3)
    (HasAngle angle0 link4)
    )
)
)

; plan
1. (decrease_angle link1 angle300 angle240)
   deleted: (hasangle angle300 link1) (hasangle angle300 link2) (hasangle angle120 link3) (hasangle angle0 link4)
   added: (hasangle angle240 link1) (hasangle angle240 link2) (hasangle angle60 link3) (hasangle angle300 link4)
   goals met: 2 of 4
2. (decrease_angle link2 angle240 angle180)
   deleted: (hasangle angle240 link2) (hasangle angle60 link3) (hasangle angle300 link4)
   added: (hasangle angle180 link2) (hasangle angle0 link3) (hasangle angle240 link4)
   goals met: 1 of 4
3. (decrease_angle link2 angle180 angle120)
   deleted: (hasangle angle180 link2) (hasangle angle0 link3) (hasangle angle240 link4)
   added: (hasangle angle120 link2) (hasangle angle300 link3) (hasangle angle180 link4)
   goals met: 2 of 4
4. (increase_angle link3 angle300 angle0)
   deleted: (hasangle angle300 link3) (hasangle angle180 link4)
   added: (hasangle angle0 link3) (hasangle angle240 link4)
   goals met: 2 of 4
5. (increase_angle link3 angle0 angle60)
   deleted: (hasangle angle0 link3) (hasangle angle240 link4)
   added: (hasangle angle60 link3) (hasangle angle300 link4)
   goals met: 3 of 4
6. (increase_angle link4 angle300 angle0)
   deleted: (hasangle angle300 link4)
   added: (hasangle angle0 link4)
   goals met: 4 of 4
